cmsis-svd/cmsis-svd/data/Fujitsu/MB9B160L.xml
        <!-- REGISTER "PRLH19" -->
        <register derivedFrom="PRLH0">
          <name>PRLH19</name>
          <description>PPG19 Reload Registers High</description>
          <addressOffset>0x315</addressOffset>
        </register>
        <!-- REGISTER "PRLL19" -->
        <register derivedFrom="PRLL0">
          <name>PRLL19</name>
          <description>PPG19 Reload Registers Low</description>
          <addressOffset>0x314</addressOffset>
        </register>
        <!-- REGISTER "PRLH20" -->
        <register derivedFrom="PRLH0">
          <name>PRLH20</name>
          <description>PPG20 Reload Registers High</description>
          <addressOffset>0x349</addressOffset>
        </register>
        <!-- REGISTER "PRLL20" -->
        <register derivedFrom="PRLL0">
          <name>PRLL20</name>
          <description>PPG20 Reload Registers Low</description>
          <addressOffset>0x348</addressOffset>
        </register>
        <!-- REGISTER "PRLH21" -->
        <register derivedFrom="PRLH0">
          <name>PRLH21</name>
          <description>PPG21 Reload Registers High</description>
          <addressOffset>0x34D</addressOffset>
        </register>
        <!-- REGISTER "PRLL21" -->
        <register derivedFrom="PRLL0">
          <name>PRLL21</name>
          <description>PPG21 Reload Registers Low</description>
          <addressOffset>0x34C</addressOffset>
        </register>
        <!-- REGISTER "PRLH22" -->
        <register derivedFrom="PRLH0">
          <name>PRLH22</name>
          <description>PPG22 Reload Registers High</description>
          <addressOffset>0x351</addressOffset>
        </register>
        <!-- REGISTER "PRLL22" -->
        <register derivedFrom="PRLL0">
          <name>PRLL22</name>
          <description>PPG22 Reload Registers Low</description>
          <addressOffset>0x350</addressOffset>
        </register>
        <!-- REGISTER "PRLH23" -->
        <register derivedFrom="PRLH0">
          <name>PRLH23</name>
          <description>PPG23 Reload Registers High</description>
          <addressOffset>0x355</addressOffset>
        </register>
        <!-- REGISTER "PRLL23" -->
        <register derivedFrom="PRLL0">
          <name>PRLL23</name>
          <description>PPG23 Reload Registers Low</description>
          <addressOffset>0x354</addressOffset>
        </register>
        <!-- REGISTER "GATEC0" -->
        <register>
          <name>GATEC0</name>
          <description>PPG Gate Function Control Registers 0</description>
          <addressOffset>0x218</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0x33</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "STRG2" -->
            <field>
              <name>STRG2</name>
              <description>Select a trigger for PPG2</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "EDGE2" -->
            <field>
              <name>EDGE2</name>
              <description>Select Start Effective Level for PPG2</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "STRG0" -->
            <field>
              <name>STRG0</name>
              <description>Select a trigger for PPG0</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "EDGE0" -->
            <field>
              <name>EDGE0</name>
              <description>Select Start Effective Level for PPG0</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "GATEC4" -->
        <register>
          <name>GATEC4</name>
          <description>PPG Gate Function Control Registers 4</description>
          <addressOffset>0x258</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0x33</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "STRG6" -->
            <field>
              <name>STRG6</name>
              <description>Select a trigger for PPG6</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "EDGE6" -->
            <field>
              <name>EDGE6</name>
              <description>Select Start Effective Level for PPG6</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "STRG4" -->
            <field>
              <name>STRG4</name>
              <description>Select a trigger for PPG4</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "EDGE4" -->
            <field>
              <name>EDGE4</name>
              <description>Select Start Effective Level for PPG4</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "GATEC8" -->
        <register>
          <name>GATEC8</name>
          <description>PPG Gate Function Control Registers 8</description>
          <addressOffset>0x298</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0x33</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "STRG10" -->
            <field>
              <name>STRG10</name>
              <description>Select a trigger for PPG10</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "EDGE10" -->
            <field>
              <name>EDGE10</name>
              <description>Select Start Effective Level for PPG10</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "STRG8" -->
            <field>
              <name>STRG8</name>
              <description>Select a trigger for PPG8</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "EDGE8" -->
            <field>
              <name>EDGE8</name>
              <description>Select Start Effective Level for PPG8</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "GATEC12" -->
        <register>
          <name>GATEC12</name>
          <description>PPG Gate Function Control Registers 12</description>
          <addressOffset>0x2D8</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0x33</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "STRG14" -->
            <field>
              <name>STRG14</name>
              <description>Select a trigger for PPG14</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "EDGE14" -->
            <field>
              <name>EDGE14</name>
              <description>Select Start Effective Level for PPG14</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "STRG12" -->
            <field>
              <name>STRG12</name>
              <description>Select a trigger for PPG12</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "EDGE12" -->
            <field>
              <name>EDGE12</name>
              <description>Select Start Effective Level for PPG12</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "GATEC16" -->
        <register>
          <name>GATEC16</name>
          <description>PPG Gate Function Control Registers 16</description>
          <addressOffset>0x318</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0x33</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "STRG18" -->
            <field>
              <name>STRG18</name>
              <description>Select a trigger for PPG18</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "EDGE18" -->
            <field>
              <name>EDGE18</name>
              <description>Select Start Effective Level for PPG18</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "STRG16" -->
            <field>
              <name>STRG16</name>
              <description>Select a trigger for PPG16</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "EDGE16" -->
            <field>
              <name>EDGE16</name>
              <description>Select Start Effective Level for PPG16</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "GATEC20" -->
        <register>
          <name>GATEC20</name>
          <description>PPG Gate Function Control Registers 20</description>
          <addressOffset>0x358</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0x33</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "STRG22" -->
            <field>
              <name>STRG22</name>
              <description>Select a trigger for PPG22</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "EDGE22" -->
            <field>
              <name>EDGE22</name>
              <description>Select Start Effective Level for PPG22</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "STRG20" -->
            <field>
              <name>STRG20</name>
              <description>Select a trigger for PPG20</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "EDGE20" -->
            <field>
              <name>EDGE20</name>
              <description>Select Start Effective Level for PPG20</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
