cmsis-svd/cmsis-svd/data/Fujitsu/MB9B160L.xml
        <!-- REGISTER "IRQ103MON" -->
        <register>
          <name>IRQ103MON</name>
          <description>IRQ103 Batch Read Register</description>
          <addressOffset>0x3A0</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
        </register>
        <!-- REGISTER "IRQ104MON" -->
        <register>
          <name>IRQ104MON</name>
          <description>IRQ104 Batch Read Register</description>
          <addressOffset>0x3A4</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
        </register>
        <!-- REGISTER "IRQ105MON" -->
        <register>
          <name>IRQ105MON</name>
          <description>IRQ105 Batch Read Register</description>
          <addressOffset>0x3A8</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
        </register>
        <!-- REGISTER "IRQ106MON" -->
        <register>
          <name>IRQ106MON</name>
          <description>IRQ106 Batch Read Register</description>
          <addressOffset>0x3AC</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
        </register>
        <!-- REGISTER "IRQ107MON" -->
        <register>
          <name>IRQ107MON</name>
          <description>IRQ107 Batch Read Register</description>
          <addressOffset>0x3B0</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
        </register>
        <!-- REGISTER "IRQ108MON" -->
        <register>
          <name>IRQ108MON</name>
          <description>IRQ108 Batch Read Register</description>
          <addressOffset>0x3B4</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
        </register>
        <!-- REGISTER "IRQ109MON" -->
        <register>
          <name>IRQ109MON</name>
          <description>IRQ109 Batch Read Register</description>
          <addressOffset>0x3B8</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
        </register>
        <!-- REGISTER "IRQ110MON" -->
        <register>
          <name>IRQ110MON</name>
          <description>IRQ110 Batch Read Register</description>
          <addressOffset>0x3BC</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x3</resetMask>
        </register>
        <!-- REGISTER "IRQ111MON" -->
        <register>
          <name>IRQ111MON</name>
          <description>IRQ111 Batch Read Register</description>
          <addressOffset>0x3C0</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
        </register>
        <!-- REGISTER "IRQ112MON" -->
        <register>
          <name>IRQ112MON</name>
          <description>IRQ112 Batch Read Register</description>
          <addressOffset>0x3C4</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
        </register>
        <!-- REGISTER "IRQ113MON" -->
        <register>
          <name>IRQ113MON</name>
          <description>IRQ113 Batch Read Register</description>
          <addressOffset>0x3C8</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "USB_DRQ_INT4" -->
            <field>
              <name>USB_DRQ_INT4</name>
              <description>Endpoint 5 DRQ interrupt request of the USB ch.1</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "USB_DRQ_INT3" -->
            <field>
              <name>USB_DRQ_INT3</name>
              <description>Endpoint 4 DRQ interrupt request of the USB ch.1</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "USB_DRQ_INT2" -->
            <field>
              <name>USB_DRQ_INT2</name>
              <description>Endpoint 3 DRQ interrupt request of the USB ch.1</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "USB_DRQ_INT1" -->
            <field>
              <name>USB_DRQ_INT1</name>
              <description>Endpoint 2 DRQ interrupt request of the USB ch.1</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "USB_DRQ_INT0" -->
            <field>
              <name>USB_DRQ_INT0</name>
              <description>Endpoint 1 DRQ interrupt request of the USB ch.1</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IRQ114MON" -->
        <register>
          <name>IRQ114MON</name>
          <description>IRQ114 Batch Read Register</description>
          <addressOffset>0x3CC</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x3F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "USB_INT5" -->
            <field>
              <name>USB_INT5</name>
              <description>SOFIRQ/CMPIRQ interrupt request of the USB ch.1</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "USB_INT4" -->
            <field>
              <name>USB_INT4</name>
              <description>DIRQ/URPIRQ/RWKIRQ/CNNIRQ interrupt request of the USB ch.1</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "USB_INT3" -->
            <field>
              <name>USB_INT3</name>
              <description>SPK interrupt request of the USB ch.1</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "USB_INT2" -->
            <field>
              <name>USB_INT2</name>
              <description>SUSP/SOF/BRST/CONF/WKUP interrupt request of the USB ch.1</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "USB_INT1" -->
            <field>
              <name>USB_INT1</name>
              <description>Endpoint 0 DRQO interrupt request of the USB ch.1</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "USB_INT0" -->
            <field>
              <name>USB_INT0</name>
              <description>Endpoint 0 DRQI interrupt request of the USB ch.1</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
